Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.Revision.ReferenceModelId Property
 Gets or sets the parent reference model id.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int ReferenceModelId {
	get;
 }
Public ReadOnly Property ReferenceModelId As Integer
		Get
Property Value
Type: Int32
 The reference model id.
See Also
Reference
ReferenceModel.Revision Structure
Tekla.Structures.Model Namespace